# SheetCurrentRevisionDate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetCurrentRevisionDate Property
ParameterTypeId Class See Also
---
"Current Revision Date"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetCurrentRevisionDate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetCurrentRevisionDate As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetCurrentRevisionDate {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace